import pythonSvg from '@/assets/images/courses/preview/python.svg'
import javaSvg from '@/assets/images/courses/preview/java.svg'
import dataAnalyticsSvg from '@/assets/images/courses/preview/dataAnalytics.svg'

import pythonLogo from '@/assets/images/courses/python.png'

export default {
  theme: {
    light: 'Жарық',
    dark: 'Қараңғы'
  },
  page: {
    main: {
      intro: {
        title: '"Бастысы - идея мен амбиция"',
        name: 'Якуб'
      },
      header: {
        my_training: 'Менің оқуым',
        all_courses: 'Барлық курстар',
        contacts: 'Байланыстар',
        team: 'Команда',
        about: "'Gasyr Lab' туралы",
        dropdown: {
          log_out: 'Шығу'
        },
        login: 'Кіру',
        register: 'Тіркелу'
      },
      main: {
        scrollHorizontal: {
          title: 'Демеушілер'
        },
        greetingSection: {
          title: 'Сапа мен қолжетімділікке негізделген ғасырға сай білім беретін онлайн IT мектебі',
          subtitle: 'Компаниялар біздің түлектерді өздері күтеді'
        },
        ourCourses: {
          title: 'Бағыттар мен Курстар',
          courses: [
            {
              id: 1,
              title: 'Python Жалыпшысы',
              titleDescription() {
                return `Python үйрену оңай, тіпті сіз ешқашан бағдарламаламасаңыз да. Тренинг барысында сізге тәжірибелі тәлімгер көмектеседі. Сіз ${this.fullProjects} портфолио жобасын әзірлейсіз, ал Мансап орталығы сізге Python әзірлеушісі ретінде жұмыс табуға көмектеседі.`
              },
              cardDescription() {
                return `Біздің курсы ${this.contentsCourse.allListChapters()} дерс/ ${this.contentsCourse.list.length} бөлімден тұрғыз. Курс аяқталған ертеңде сенің портфолиода ${this.fullProjects} проект болады. Мәлімет: ${this.duration} апта. `
              },
              duration: 28,
              fullProjects: 3,
              previewImage: pythonSvg,
              circleItem: ['Онлайн', 'Басталуы: 6 мамыр'],
              courseImage: pythonLogo,
              beingScratch() {
                return `${this.duration} апта ішінде`
              },
              aboutProfession: {
                title: 'Жұмыс туралы',
                description:
                  'Python - бастапқыштар үшін жақсы тіл. Python коды жазылу және оқылу өтілі, тіл рейтингтерінде жалпы қолданушылықтай барып тұрып, "Pythonшылар" өз өмірлеріндегі IT-программирования, данный анализ, система басқару және тесттерде талап етуді. YouTube, Intel, Pixar, NASA, ВКонтакте, Яндекс - бірнеше танымалы компаниялардың үйімдарында Python пайдаланып табылады.',
                salary: '400 000 тенге',
                avarageSalary: 'специалисттердің орташа зарплатасы',
                durationDescription:
                  'курстағы қасымдық оқу және практика келесі сіздің бірінші жұмысқа тапсыз'
              },
              requiredEmployee: {
                title: 'Курс қажеттірушылардың қажеттерілетін өткізген өріске жасалған',
                description:
                  'Біз рынқтың зерттеулерін жасаймыз, үлкен компанияларды өз қажеттірушылары үшін қажеттерілетін сұраймыз, вакансияларды және эксперт қарауындарын тексеріміз. Олардың базына, біз курсқа тіркелмейтін ен қажетті болады.'
              },
              contentsCourse: {
                title: 'Курс қасымдары',
                description: `Сіз {this.fullProjects} блоктарды табынасыз Python программировау үшін өз дерігерінен қолдану және қосымша курстар.`,
                allListChapters() {
                  let sum = 0
                  this.list.forEach((item) => (sum += item.accordionList.length))
                  return sum
                },
                list: [
                  {
                    id: 1,
                    title: 'Python Базысы. 1-бөлім',
                    accordionList: [
                      {
                        title: 'Қосылу'
                      },
                      {
                        title: 'Python базысы'
                      },
                      {
                        title: 'Операторлар және ішкіштер'
                      }
                    ]
                  },
                  {
                    id: 2,
                    title: 'Python Базысы. 2-бөлім: Telegram үшін чат-бот',
                    accordionList: [
                      {
                        title: 'IDE орнатын және конфигурациялау'
                      },
                      {
                        title: 'Бастапқы жіделер. Массивтер'
                      },
                      {
                        title: 'List: массивтермен жұмыс істеу әдістері'
                      }
                    ]
                  },
                  {
                    id: 3,
                    title: 'Python-фреймворк Django',
                    accordionList: [
                      {
                        title: 'Веб-фреймворктардың кіріспесі'
                      },
                      {
                        title: 'Djangoга қосылу'
                      },
                      {
                        title: 'Веб және Linuxга қосылу'
                      },
                      {
                        title: 'База данных және модельдер'
                      }
                    ]
                  },
                  {
                    id: 4,
                    title: 'Командалық проект: маркетплейс жасау',
                    accordionList: [
                      {
                        title:
                          'Тимлидмен және 3-5 қатынас қызметкерлерден тұрғыз маркетплейс үшін серверді жасауға қосылыңыз. Сіз Scrum немесе Kanban системасына өткізбесіз, тимлидмен жаңартылған прогрессі қарап туралып, жаңа тапсырмаларды алуға болады. Барлық процессер әсірге максималдық және әлеуметтік қызметкерлердегі коммерциялық программалық құрылымдарды жасау үшін өте жатқан. Натыйжасында сенің соңында "Яндекс Маркет" қажетті аналогын жасасыңыз.'
                      }
                    ]
                  },
                  {
                    id: 5,
                    title: 'Python Advanced: социальная сеть',
                    accordionList: [
                      {
                        title: 'Flask: басталу'
                      },
                      {
                        title: 'Linux Базысы. 1-бөлім'
                      }
                    ]
                  }
                ]
              },
              helpCenter: {
                title: 'Жұмыс алу қызметі',
                benefits: [
                  {
                    id: 1,
                    bgColor: '#FFE96E',
                    title: 'Резюме',
                    description: 'Біз сені қосымша жерде қажеттірушыға таныстыруымыз керек'
                  },
                  {
                    id: 2,
                    bgColor: '#DCF4FE',
                    title: 'Індивідуальды жалпы қаржырау',
                    description:
                      'Біз сенің жалпы қаржырауың қажеттіру жағдайын өткізуге көмектесеміз'
                  },
                  {
                    id: 3,
                    bgColor: '#AFE9B4',
                    title: 'Бірге болған вакансиялар',
                    description: 'Біз сенің қажеттіруіңізді өңдедік'
                  },
                  {
                    id: 4,
                    bgColor: '#FEBCB4',
                    title: 'Портфолио жасау',
                    description: 'Біз сенің проекттеріңді қосымша көрсетуге көмектесеміз'
                  }
                ]
              },
              rate: {
                title: 'Сіздің тарифіңізді таңдаңыз',
                paket: [
                  {
                    title: 'Стадарт',
                    description: 'Оқушылардың қоғамдық оқу',
                    list: [
                      {
                        title: '3 проект портфолиода'
                      },
                      {
                        title: 'Карьерның қолданысу'
                      },
                      {
                        title: 'Жұмыс қажеттіру қарантының қажеті'
                      },
                      {
                        title: 'Бессрочный доступ к учебным материалам'
                      },
                      {
                        title: 'Комплекстік подготовка'
                      },
                      {
                        title: 'Профориентация'
                      }
                    ]
                  },
                  {
                    title: 'Стадарт',
                    description: 'Оқушылардың қоғамдық оқу',
                    list: [
                      {
                        title: '3 проект портфолиода'
                      },
                      {
                        title: 'Карьерның қолданысу'
                      },
                      {
                        title: 'Жұмыс қажеттіру қарантының қажеті'
                      },
                      {
                        title: 'Бессрочный доступ к учебным материалам'
                      },
                      {
                        title: 'Комплекстік подготовка'
                      },
                      {
                        title: 'Профориентация'
                      },
                      {
                        title: 'Персональный график'
                      },
                      {
                        title: 'Індивідуальды оқу қолданыстыруы'
                      },
                      {
                        title: '80 сағат персональдық мәселелерді қарап қою үшін басқарушымен'
                      }
                    ]
                  }
                ]
              },
              modalWindow: {
                title: 'Тариф',
                subtitle: 'Өтініш қоюға жазыңыз және біздің басқарушымыз сенің қолдаңыздағы болады',
                description: 'Сіз программаны төлеп, оқытуға баста аласыз',

                input: {
                  name: 'Атыңыз',
                  email: 'Электрондық пошта',
                  tel: 'Телефон нөмірі'
                }
              }
            }
          ]
        },
        subscription: {
          title: 'Таңдаумен көмектесеміз',
          desc: 'Егер сізде формат туралы сұрақтарыңыз болса немесе не таңдау керектігін білмесеңіз, нөміріңізді қалдырыңыз - біз қоңырау шалып, барлық сұрақтарға жауап береміз',
          inputName: 'Есімі',
          inputSurname: 'Тегі',
          rules:
            'Нысанды жіберу арқылы сіз “Дербес деректерді өңдеу туралы келісімді" және "Оферта" шарттарын қабылдау, сондай-ақ "Пайдаланушы шарттары" бойынша келісіміңізді бересіз'
        },
        ourTeam: {
          title: 'Біздің тобымыз'
        }
      },
      footer: {
        newsletter: {
          title: 'Барлығы туралы хабардар болу үшін біздің ақпараттық бюллетеньге жазылыңыз!',
          desc: 'Біздің саладағы барлық оқиғалардан хабардар болыңыз және маңызды бөлшектерді жіберіп алмаңыз. Дәл қазір біздің ақпараттық ортаға қосылыңыз және болып жатқан оқиғалардың ортасында болыңыз!'
        },
        list: {
          aboutUs: {
            title: 'Біз жайлы',
            school: 'Мектеп',
            java: '"Java" жайлы Курс',
            python: '"Python" жайлы Курс',
            dataAnalytics: '"Data Analytics" жайлы Курс'
          },
          help: {
            title: 'Көмек',
            ref: 'Анықтама',
            community: 'Қауымдастық',
            support: 'Техникалық көмек',
            faq: 'Сұрақ жән Жауап'
          },
          contacts: {
            title: 'Байланыстар',
            info: 'Ақпарат',
            address: 'Жандосов, 36'
          }
        }
      }
    },
    auth: {
      greetingSignIn: 'Қайта тіркелгендер!',
      greetingSignUp: 'Сәлем, достым!',
      textSignIn:
        'Барлық сайт функцияларын пайдалану үшін сіздің персоналдық маълуметерін енгізіңіз',
      textSignUp:
        'Барлық сайт функцияларын пайдалану үшін сіздің персоналдық маълуметерімен тіркелуді жасаңыз',

      login: {
        title: 'Кіру',
        inputEmail: 'Эл. Пошта',
        inputPassword: 'Құпия сөз',
        signIn: 'Кіру',
        errors: {
          requiredField: 'Міндетті өріс',
          existingPasswordAndEmail: 'Дұрыс электрондық пошта мен құпия сөзді енгізіңіз'
        }
      },
      register: {
        title: 'Тіркелу',
        inputName: 'Аты',
        inputSurname: 'Тегі',
        inputEmail: 'Электронды пошта',
        inputPassword: 'Құпия сөз',
        signUp: 'Тіркелу',
        errors: {
          requiredField: 'Міндетті өріс',
          minFieldLength: 'Ең аз 6 таңба',
          correctEmail: 'Дұрыс электрондық пошта енгізіңіз'
        }
      }
    }
  },
  global: {
    btn: {
      default: 'Толығырақ',
      subscribe: 'Тіркелу',
      move: 'Өту',
      back: 'Артқа',
      bookCourse: 'Курсқа жазылу',
      demand: 'Өтініш қалдыру'
    }
  }
}
